In [1]:
import pandas as pd

In [57]:
df1 = pd.read_csv('sample.csv')
df1.columns = map(str.lower, df1.columns)
df1

                    title  year          director
0      North by Northwest  1959  Alfred Hitchcock
1               Notorious  1946  Alfred Hitchcock
2  The Philadelphia Story  1940      George Cukor
3        To Catch a Thief  1955  Alfred Hitchcock
4         His Girl Friday  1940      Howard Hawks

In [4]:
df1.dtypes

title       object
year         int64
director    object
dtype: object

In [5]:
df1.groupby('director')

In [6]:
df1.groupby('director').head()  # looks the same!

                    title  year          director
0      North by Northwest  1959  Alfred Hitchcock
1               Notorious  1946  Alfred Hitchcock
2  The Philadelphia Story  1940      George Cukor
3        To Catch a Thief  1955  Alfred Hitchcock
4         His Girl Friday  1940      Howard Hawks

In [7]:
df1.groupby('director').head().equals(df1)

True

In [8]:
df1.reindex_axis(df1.director)

                 title  year director
director
Alfred Hitchcock   NaN   NaN      NaN
Alfred Hitchcock   NaN   NaN      NaN
George Cukor       NaN   NaN      NaN
Alfred Hitchcock   NaN   NaN      NaN
Howard Hawks       NaN   NaN      NaN

In [9]:
list(df1.groupby('director'))

[('Alfred Hitchcock',                 title  year          director
  0  North by Northwest  1959  Alfred Hitchcock
  1           Notorious  1946  Alfred Hitchcock
  3    To Catch a Thief  1955  Alfred Hitchcock),
 ('George Cukor',                     title  year      director
  2  The Philadelphia Story  1940  George Cukor),
 ('Howard Hawks',              title  year      director
  4  His Girl Friday  1940  Howard Hawks)]

In [10]:
df1.groupby('director').get_group('Alfred Hitchcock')

                title  year          director
0  North by Northwest  1959  Alfred Hitchcock
1           Notorious  1946  Alfred Hitchcock
3    To Catch a Thief  1955  Alfred Hitchcock

In [11]:
df1.groupby('director').first()

                                   title  year
director
Alfred Hitchcock      North by Northwest  1959
George Cukor      The Philadelphia Story  1940
Howard Hawks             His Girl Friday  1940

In [12]:
df1.groupby('director').last()

                                   title  year
director
Alfred Hitchcock        To Catch a Thief  1955
George Cukor      The Philadelphia Story  1940
Howard Hawks             His Girl Friday  1940

In [13]:
df1.groupby('director').max()

                                   title  year
director
Alfred Hitchcock        To Catch a Thief  1959
George Cukor      The Philadelphia Story  1940
Howard Hawks             His Girl Friday  1940

In [14]:
df1.groupby('director').max().ix['Alfred Hitchcock']

title    To Catch a Thief
year                 1959
Name: Alfred Hitchcock, dtype: object

In [31]:
df2 = df1.groupby(['director', df1.index]).first()
df2

                                     title  year
director
Alfred Hitchcock 0      North by Northwest  1959
                 1               Notorious  1946
                 3        To Catch a Thief  1955
George Cukor     2  The Philadelphia Story  1940
Howard Hawks     4         His Girl Friday  1940

In [52]:
df3 = df2.reset_index('director')
df3

           director                   title  year
0  Alfred Hitchcock      North by Northwest  1959
1  Alfred Hitchcock               Notorious  1946
3  Alfred Hitchcock        To Catch a Thief  1955
2      George Cukor  The Philadelphia Story  1940
4      Howard Hawks         His Girl Friday  1940

In [60]:
df4 = df3[['title', 'year', 'director']] #.equals(df1)
df4

                    title  year          director
0      North by Northwest  1959  Alfred Hitchcock
1               Notorious  1946  Alfred Hitchcock
3        To Catch a Thief  1955  Alfred Hitchcock
2  The Philadelphia Story  1940      George Cukor
4         His Girl Friday  1940      Howard Hawks

In [67]:
df4.sort_index()#.equals(df1)

                    title  year          director
0      North by Northwest  1959  Alfred Hitchcock
1               Notorious  1946  Alfred Hitchcock
2  The Philadelphia Story  1940      George Cukor
3        To Catch a Thief  1955  Alfred Hitchcock
4         His Girl Friday  1940      Howard Hawks

In [76]:
df1

                    title  year          director
0      North by Northwest  1959  Alfred Hitchcock
1               Notorious  1946  Alfred Hitchcock
2  The Philadelphia Story  1940      George Cukor
3        To Catch a Thief  1955  Alfred Hitchcock
4         His Girl Friday  1940      Howard Hawks

In [73]:
df1.dtypes

title       object
year         int64
director    object
dtype: object

In [74]:
df4.sort_index().dtypes

title       object
year         int64
director    object
dtype: object

In [75]:
df1.index == df4.sort_index().index

array([ True,  True,  True,  True,  True], dtype=bool)

In [71]:
print(df1)
print(df1 == df4.sort_index())
print(df1.equals(df4.sort_index()))

                    title  year          director
0      North by Northwest  1959  Alfred Hitchcock
1               Notorious  1946  Alfred Hitchcock
2  The Philadelphia Story  1940      George Cukor
3        To Catch a Thief  1955  Alfred Hitchcock
4         His Girl Friday  1940      Howard Hawks
  title  year director
0  True  True     True
1  True  True     True
2  True  True     True
3  True  True     True
4  True  True     True
False

In [46]:
df2.reset_index(1, col_fill='blah')
#'director')
#pd.DataFrame(index=df2.index)

                  level_1                   title  year
director
Alfred Hitchcock        0      North by Northwest  1959
Alfred Hitchcock        1               Notorious  1946
Alfred Hitchcock        3        To Catch a Thief  1955
George Cukor            2  The Philadelphia Story  1940
Howard Hawks            4         His Girl Friday  1940

In [35]:
df2.unstack(level=0)

                       title                                           \
director    Alfred Hitchcock            George Cukor     Howard Hawks
0         North by Northwest                     NaN              NaN
1                  Notorious                     NaN              NaN
2                        NaN  The Philadelphia Story              NaN
3           To Catch a Thief                     NaN              NaN
4                        NaN                     NaN  His Girl Friday

                     year
director Alfred Hitchcock George Cukor Howard Hawks
0                    1959          NaN          NaN
1                    1946          NaN          NaN
2                     NaN         1940          NaN
3                    1955          NaN          NaN
4                     NaN          NaN         1940

In [36]:
df2.transpose()

director    Alfred Hitchcock                               \
                           0          1                 3
title     North by Northwest  Notorious  To Catch a Thief
year                    1959       1946              1955

director            George Cukor     Howard Hawks
                               2                4
title     The Philadelphia Story  His Girl Friday
year                        1940             1940

In [17]:
df2.ix['Alfred Hitchcock']

                title  year
0  North by Northwest  1959
1           Notorious  1946
3    To Catch a Thief  1955

In [19]:
df2.ix['Alfred Hitchcock',3]

title    To Catch a Thief
year                 1955
Name: (Alfred Hitchcock, 3), dtype: object

In [20]:
df1.groupby('director')['year'].agg([('first_year', min), ('last_year', max)])

                  first_year  last_year
director
Alfred Hitchcock        1946       1959
George Cukor            1940       1940
Howard Hawks            1940       1940

In [21]:
df1.groupby('director').agg({'title': min, 'year': max})

                                   title  year
director
Alfred Hitchcock      North by Northwest  1959
George Cukor      The Philadelphia Story  1940
Howard Hawks             His Girl Friday  1940

In [24]:
df3 = df1.groupby(['director', 'title']).first()
df3

                                         year
director         title
Alfred Hitchcock North by Northwest      1959
                 Notorious               1946
                 To Catch a Thief        1955
George Cukor     The Philadelphia Story  1940
Howard Hawks     His Girl Friday         1940

In [25]:
df4 = df1.groupby(['director', 'year']).first()
df4

                                        title
director         year
Alfred Hitchcock 1946               Notorious
                 1955        To Catch a Thief
                 1959      North by Northwest
George Cukor     1940  The Philadelphia Story
Howard Hawks     1940         His Girl Friday

In [26]:
df1.groupby(['director', 'title', 'year']).first()

Empty DataFrame
Columns: []
Index: []

In [27]:
s1 = df1.stack()
s1

0  title           North by Northwest
   year                          1959
   director          Alfred Hitchcock
1  title                    Notorious
   year                          1946
   director          Alfred Hitchcock
2  title       The Philadelphia Story
   year                          1940
   director              George Cukor
3  title             To Catch a Thief
   year                          1955
   director          Alfred Hitchcock
4  title              His Girl Friday
   year                          1940
   director              Howard Hawks
dtype: object

In [28]:
s2 = df1.unstack()
s2

title     0        North by Northwest
          1                 Notorious
          2    The Philadelphia Story
          3          To Catch a Thief
          4           His Girl Friday
year      0                      1959
          1                      1946
          2                      1940
          3                      1955
          4                      1940
director  0          Alfred Hitchcock
          1          Alfred Hitchcock
          2              George Cukor
          3          Alfred Hitchcock
          4              Howard Hawks
dtype: object

In [29]:
df3.stack()

director          title
Alfred Hitchcock  North by Northwest      year    1959
                  Notorious               year    1946
                  To Catch a Thief        year    1955
George Cukor      The Philadelphia Story  year    1940
Howard Hawks      His Girl Friday         year    1940
dtype: int64

In [30]:
df3.unstack()

                            year                               \
title            His Girl Friday North by Northwest Notorious
director
Alfred Hitchcock             NaN               1959      1946
George Cukor                 NaN                NaN       NaN
Howard Hawks                1940                NaN       NaN


title            The Philadelphia Story To Catch a Thief
director
Alfred Hitchcock                    NaN             1955
George Cukor                       1940              NaN
Howard Hawks                        NaN              NaN